
## Plan Result

[CI link](https://github.com/shimizu-atsuyoshi/live-fire-exercise/actions/runs/18095419895)


<pre><code>Plan: 11 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.timezone_compute.aws_batch_compute_environment.this
  * module.timezone_compute.aws_batch_job_queue.this
  * module.timezone_compute.aws_iam_role.this
  * module.timezone_compute.aws_iam_role_policy_attachment.this
  * module.timezone_job_definition.aws_batch_job_definition.this
  * module.timezone_job_definition.aws_cloudwatch_log_group.this
  * module.timezone_job_definition.aws_ecr_repository.this
  * module.timezone_job_definition.aws_iam_role.execution_role
  * module.timezone_job_definition.aws_iam_role.task_role
  * module.timezone_job_definition.aws_iam_role_policy.task_role_policy
  * module.timezone_job_definition.aws_iam_role_policy_attachment.execution_role_policy
* Update
  * module.bastion.aws_security_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.bastion.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-08e12e4771c3c34ef"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "live-fire-exercise-bastion-sg"
        tags                   = {
            "Name" = "live-fire-exercise-bastion-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.timezone_compute.aws_batch_compute_environment.this will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn             = (known after apply)
      + ecs_cluster_arn = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + region          = "ap-northeast-1"
      + service_role    = (known after apply)
      + state           = "ENABLED"
      + status          = (known after apply)
      + status_reason   = (known after apply)
      + tags_all        = (known after apply)
      + type            = "MANAGED"

      + compute_resources {
          + desired_vcpus = (known after apply)
          + max_vcpus     = 16
          + subnets       = [
              + "subnet-0290f4c50dc3b3bc4",
              + "subnet-05d662a6f1cbccf90",
              + "subnet-082bde1d43e8f5c4c",
            ]
          + type          = "FARGATE"

          + ec2_configuration (known after apply)
        }

      + update_policy (known after apply)
    }

  # module.timezone_compute.aws_batch_job_queue.this will be created
  + resource "aws_batch_job_queue" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "timezone"
      + priority = 1
      + region   = "ap-northeast-1"
      + state    = "ENABLED"
      + tags_all = {}

      + compute_environment_order {
          + compute_environment = (known after apply)
          + order               = 1
        }
    }

  # module.timezone_compute.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "batch.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "timezone-service-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.timezone_compute.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
      + role       = "timezone-service-role"
    }

  # module.timezone_job_definition.aws_batch_job_definition.this will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + deregister_on_new_revision = true
      + ecs_properties             = (known after apply)
      + id                         = (known after apply)
      + name                       = "timezone"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = false
      + region                     = "ap-northeast-1"
      + revision                   = (known after apply)
      + tags_all                   = (known after apply)
      + type                       = "container"
    }

  # module.timezone_job_definition.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/timezone"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.timezone_job_definition.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "timezone-batch"
      + region               = "ap-northeast-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.timezone_job_definition.aws_iam_role.execution_role will be created
  + resource "aws_iam_role" "execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "timezone-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.timezone_job_definition.aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "timezone-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.timezone_job_definition.aws_iam_role_policy.task_role_policy will be created
  + resource "aws_iam_role_policy" "task_role_policy" {
      + id          = (known after apply)
      + name        = "timezone-task-role-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.timezone_job_definition.aws_iam_role_policy_attachment.execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "timezone-execution-role"
    }

Plan: 11 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-plan","PRNumber":57,"Program":"tfcmt","SHA1":"e847ef038c655109a91b8a0745d519633074dafb","Vars":{},"WorkflowName":"aws plan"} -->